Catalogs/Товары.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Товары</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТоваров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/JSONОбъекты/Ext/Module.bsl
Функция ПолучитьВсеТоварыJSON() Экспорт 
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |  Представление(УникальныйИдентификатор(Товар.Ссылка)) КАК Код,
	 |  Товар.Наименование КАК Наименование,
	 |  Товар.Артикул КАК Артикул,
	 |  Представление(Товар.ВидТоваров) КАК ВидТоваров   
     |ИЗ
	 |  Справочник.Товары КАК Товар
	 |ГДЕ
	 |  Товар.ПометкаУдаления = ЛОЖЬ
	 |  И Товар.ЭтоГруппа = ЛОЖЬ";
	 РезультатЗапроса = Запрос.Выполнить();
	 
	 ВыборкаРезультатаЗапроса = РезультатЗапроса.Выбрать();  
	 Структура = Новый Структура("Код, Наименование, Артикул, ВидТоваров");
	 СтрокаJSON = ПолучитьJsonИзВыборки(ВыборкаРезультатаЗапроса, Структура);
	 Возврат СтрокаJSON; 
 КонецФункции
 
 Функция ПолучитьJsonИзВыборки (Выборка, Структура) Экспорт
	 Массив = Новый Массив;
	 Пока Выборка.Следующий() Цикл
		 КопияСтруктура = Новый Структура;
		 Для Каждого Элемент Из Структура Цикл
			 КопияСтруктура.Вставить(Элемент.Ключ, Элемент.Значение);
		 КонецЦикла;
		 ЗаполнитьЗначенияСвойств(КопияСтруктура, Выборка);
		 Массив.Добавить(КопияСтруктура);
	 КонецЦикла;
	 ЗаписьJSON = Новый ЗаписьJSON;
	 ЗаписьJSON.УстановитьСтроку();
	 ЗаписатьJSON(ЗаписьJSON, Массив);
	 СтрокаJSON = ЗаписьJSON.Закрыть();
     Возврат   СтрокаJSON; 
 КонецФункции 
 
 Процедура ЗагрузитьТоварыJSON(СтрокаJSON)Экспорт
	
	 ЧтениеJSON = Новый ЧтениеJSON();
	 ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	 
	 ТоварыМассив = ПрочитатьJSON(ЧтениеJSON);
	 Для Каждого СтрокаМассива Из ТоварыМассив Цикл
		 СоздатьТовар(СтрокаМассива);
	 КонецЦикла;

 КонецПроцедуры 
 
 Процедура СоздатьТовар(СтруктураСДанными)
	 
	 ТоварОбъект = Справочники.Товары.СоздатьЭлемент();
	 ТоварОбъект.Код = СтруктураСДанными.Код;
	 ТоварОбъект.Наименование = СтруктураСДанными.Наименование;
	 ТоварОбъект.Артикул = СтруктураСДанными.Артикул;  
	 ВидТоваровСтрока = СтруктураСДанными.ВидТоваров;
	 ВидТоваровИмяПеречисления = ЗначениеПеречисленияВидыТоваровПоСинониму(ВидТоваровСтрока);
	 СсылкаНаПеречисление = Перечисления.ВидыТоваров[ВидТоваровИмяПеречисления];
	 ТоварОбъект.ВидТоваров = СсылкаНаПеречисление;
	 Попытка
		 ТоварОбъект.Записать();
	 Исключение
	 КонецПопытки;
	 
 КонецПроцедуры   

Функция ЗначениеПеречисленияВидыТоваровПоСинониму(Синоним)
	КолекцияЗначенийПеречисления = Метаданные.Перечисления.ВидыТоваров.ЗначенияПеречисления;
	Для каждого НайденноеЗначение из КолекцияЗначенийПеречисления Цикл
		Если НайденноеЗначение.Синоним = Синоним Тогда
			Возврат НайденноеЗначение.Имя;
		КонецЕсли
	КонецЦикла;
	Возврат неопределено;
КонецФункции
